app/controllers/api/v1/arts_controller.rb

SELECT "arts".* FROM "arts"
---
  def index
    @arts = Art.all

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @arts = Art.find(params[:id])